app/controllers/books_controller.rb

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "impression" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["impression", "読解力についての本k"], ["updated_at", "2018-08-21 08:35:55.972265"], ["id", 1]]

  def create
    book = Book.new(book_params)
    if book.save
---
INSERT INTO "books" ("title", "impression", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "AI vs 教科書が読めない子供たち"], ["impression", "読解力についての本"], ["created_at", "2018-08-21 08:23:16.371006"], ["updated_at", "2018-08-21 08:23:16.371006"]]

  def success
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]